{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_8","layers":[{"class_name":"Conv1D","config":{"filters":6,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[20],"strides":[20],"padding":"valid","dilation_rate":[1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv1d_Conv1D8","trainable":true,"batch_input_shape":[null,20,1],"dtype":"float32"}},{"class_name":"Flatten","config":{"name":"flatten_Flatten8","trainable":true}},{"class_name":"Dense","config":{"units":2,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense8","trainable":true}}]},"keras_version":"tfjs-layers 2.0.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.0.0","convertedBy":null,"weightsManifest":[{"paths":["./aitrader_12_gbpusd.weights.bin"],"weights":[{"name":"conv1d_Conv1D8/kernel","shape":[20,1,6],"dtype":"float32"},{"name":"conv1d_Conv1D8/bias","shape":[6],"dtype":"float32"},{"name":"dense_Dense8/kernel","shape":[6,2],"dtype":"float32"},{"name":"dense_Dense8/bias","shape":[2],"dtype":"float32"}]}]}